cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'heroku/brew'

brew 'ack'
brew 'awscli'
brew 'cloc'
brew 'curl'
brew 'exiftool'
brew 'ffmpeg'
brew 'git'
brew 'git-extras'
brew 'git-flow-avh'
brew 'heroku-node'
brew 'heroku'
brew 'imageoptim-cli'
brew 'mas'
brew 'n'
brew 'node'
brew 'speedtest-cli'
brew 'tree'
brew 'unrar'
brew 'webp'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zplug'
brew 'zsh-completions'

# ---------- Casks ----------
cask '1password'
cask 'alfred'
cask 'calibre'
cask 'caprine'
cask 'charles'
cask 'cyberduck'
cask 'discord'
cask 'doxie'
cask 'dropbox'
cask 'firefox'
cask 'fitbit-connect'
cask 'fork'
cask 'google-hangouts'
cask 'imagealpha'
cask 'imageoptim'
cask 'integrity'
cask 'iterm2'
cask 'keybase'
cask 'licecap'
cask 'macdown'
cask 'neofinder'
cask 'notion'
cask 'panic-unison'
cask 'paw'
cask 'private-internet-access'
cask 'signal'
cask 'slack'
cask 'postgres'
cask 'sequel-pro'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# ---------- Quicklook Plugins ----------
cask 'qlcolorcode'
cask 'qlImageSize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# ---------- Fonts ----------
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hasklig'
cask 'font-lato'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-ubuntu'

# ---------- App Store ----------
mas 'Airmail', id: 918858936
mas 'Amphetamine', id: 937984704
mas 'DaisyDisk', id: 411643860
mas 'Dash', id: 458034879
mas 'Deckset', id: 847496013
mas 'iA Writer Classic', id: 439623248
mas 'Icon Slate', id: 439697913
mas 'Paste', id: 967805235
mas 'Sip', id: 507257563
mas 'Wunderlist', id: 410628904
mas 'Xcode', id: 497799835
